yschaeff/rabies/rabi-py32f0/raddr/main.c
#include <py32f0xx_hal.h>
#include "clk_config.h"

#include "uid.h"
#include "input_output.h"
#include "wolf.h"
#include "pack.h"

#include "timing_debug.h"

/*  A wolf is:
 *  Pin     Port(s)         PCB function    SPI1        I2C     UART1       TIM1        Alternate functions
 *  Pin 8   GND             GND             -
 *  Pin 7   PA1             switch          SCK/MOSI            RTS         CH4 / CH2N
 *  Pin 6   PA2/PF2         reset           SCK/MOSI    SDA     TX                      COMP2_OUT (PF2: RESET/MCO)
 *  Pin 5   PA13            SWD             MISO                RX          CH2         SWDIO
 *  Pin 4   PA14/PB3        SWC             SCK                 TX / RTS    CH2         SWCLK / MCO
 *  Pin 3   PA3             KEY Data inp    MOSI        SCL     RX          CH1
 *  Pin 2   PA4/PA10        KEY Data out    NSS         SDA/SCL CK /RX /TX  CH3
 *  Pin 1   VCC             VCC             -
 * */

#define SWC_PIN     GPIO_PIN_1
#define KEY_IN_PIN  GPIO_PIN_3
#define KEY_OUT_PIN GPIO_PIN_10

/**
 * These need to be implemented by us, They are used
 * by the pack.c code
 */
bool K_BINARY_INPUTS[K] = {0};



static void cfg_pin(uint32_t pin, uint32_t mode, uint32_t pull, uint32_t alternate)
{
    GPIO_InitTypeDef pin_cfg;

    pin_cfg.Pin   = pin;
    pin_cfg.Mode  = mode;
    pin_cfg.Pull  = pull;
    pin_cfg.Speed = GPIO_SPEED_FREQ_HIGH;
    pin_cfg.Alternate = alternate;
    HAL_GPIO_Init(GPIOA, &pin_cfg);
}

static void cfg_gpio(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
    cfg_pin(SWC_PIN,     GPIO_MODE_IT_RISING_FALLING, GPIO_PULLUP, 0);
    cfg_pin(KEY_IN_PIN,  GPIO_MODE_AF_OD, GPIO_PULLUP, GPIO_AF13_TIM1);
    cfg_pin(KEY_OUT_PIN, GPIO_MODE_AF_PP, GPIO_PULLDOWN, GPIO_AF2_TIM1);

    /* EXTI interrupt init */
    HAL_NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW, 0);
    HAL_NVIC_EnableIRQ(EXTI0_1_IRQn);

}

/**
 * Switch interrupt handler
 * Rising and falling edges
 */
void EXTI0_1_IRQHandler(void)
{
    //I think this causes bounce issues
    K_BINARY_INPUTS[0] = !HAL_GPIO_ReadPin(GPIOA, SWC_PIN);
    __HAL_GPIO_EXTI_CLEAR_IT(SWC_PIN);
}

int main(void)
{
    /* Setup clock BEFORE HAL_Init.
     * And before running anything else */
    BSP_HSI_24MHzClockConfig();
    HAL_Init();
#if defined USE_SEMIHOSTING
    {
        //This 'magic' function needs to be called.
        //libgloss will setup I/O structures to use
        extern void initialise_monitor_handles();
        initialise_monitor_handles();
        printf("PY32F0xx\r\nSystem Clock: %ld\r\n", SystemCoreClock);
        uid_print();
    }
#endif

    cfg_gpio();
    raddr_input_output_init();

    uint32_t t_bounce = 0;

#ifdef TIMING_DEBUG
    debug_find_lowest_values();
#endif

    /* Main loop */
    while (1) {
        uint32_t now = HAL_GetTick();

        if (!receive_bits_available()) {
            // if no data, take the time to update inputs
            bool input = !HAL_GPIO_ReadPin(GPIOA, SWC_PIN);
            // if input changed only set it when done bouncing
            if (input^K_BINARY_INPUTS[0] && t_bounce < now) {
                K_BINARY_INPUTS[0] = input;
                t_bounce = now + 2; // only accept change in 2ms
            }
            continue;
        }

        int bit = receive_bit();

        switch(bit) {
            case 0 ... 1:
                join_cry(bit, CRY_OKAY);
                break;
            case -1:
                //Reset
                /* The input capture got confused, or a forced reset is applied */
#if defined USE_SEMIHOSTING
                //printf("Received RESET!\r\n");
#endif
                join_cry(!GROWL, CRY_RESET);
                raddr_output_schedule(us_to_tick(TRESET), us_to_tick(TRESET) / 2);
                break;

            default:
#if defined USE_SEMIHOSTING
                printf("Received unknown bit!\r\n");
#endif
                break;
        }
    }
}


void APP_ErrorHandler(void)
{
    while (1);
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Export assert error source and line number
 */
void assert_failed(uint8_t *file, uint32_t line)
{
    /* printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    while (1);
}
#endif /* USE_FULL_ASSERT */
